[
  "Did you know? JavaScript was created in just 10 days!",
  "The first computer bug was an actual moth.",
  "The first programmer was Ada Lovelace in the 1800s.",
  "Python is named after Monty Python, not the snake.",
  "HTML stands for HyperText Markup Language.",
  "CSS was first proposed in 1994 by Håkon Wium Lie.",
  "Google was originally called Backrub.",
  "The first website is still online: info.cern.ch",
  "Stack Overflow has over 18 million questions.",
  "There are over 1.9 billion websites on the internet.",
  "Linux was created by Linus Torvalds in 1991.",
  "The first computer virus was called Creeper.",
  "Open-source software powers 95% of cloud workloads.",
  "The first 1GB hard drive weighed over 500 pounds.",
  "Java was originally called Oak.",
  "The emoji was invented in Japan in 1999.",
  "The first email was sent in 1971 by Ray Tomlinson.",
  "Facebook was launched in 2004 from a dorm room.",
  "The first video game was Pong, created in 1972.",
  "The @ symbol is called 'at' and used in email addresses.",
  "HTTP stands for HyperText Transfer Protocol.",
  "The first programming language was Fortran.",
  "More than 90% of the world's currency exists only digitally.",
  "Cloud computing started gaining popularity in early 2000s.",
  "The word 'bug' in programming means an error or flaw.",
  "Python is one of the most popular languages for AI.",
  "The 'Hello World' program is traditionally the first code.",
  "JavaScript runs on both client and server sides.",
  "CSS Grid revolutionized layout design in 2017.",
  "Git was created by Linus Torvalds in 2005.",
  "Stack Overflow helps millions of programmers daily.",
  "Google's search algorithm is called PageRank.",
  "The first mobile phone was invented in 1973.",
  "Bluetooth is named after a Viking king, Harald Bluetooth.",
  "Moore's law predicted doubling of transistors every 2 years.",
  "The first computer mouse was made of wood.",
  "ASCII was first published in 1963.",
  "Cloudflare protects millions of websites worldwide.",
  "Quantum computing uses quantum bits called qubits.",
  "AI can now beat humans at complex games like Go.",
  "The term 'cyberspace' was coined in 1982.",
  "Email spam was first sent in 1978.",
  "JavaScript was created by Brendan Eich in 1995.",
  "The dark web consists of sites not indexed by search engines.",
  "Bitcoin was invented in 2009 by an unknown person.",
  "CSS stands for Cascading Style Sheets.",
  "The first laptop was introduced in 1981.",
  "Python supports multiple programming paradigms.",
  "Machine learning is a subset of artificial intelligence.",
  "The cloud is essentially huge data centers accessible online."
]
